"use strict";
// Задача 05. З клавіатури вводиться назва категорії водія (А-мотоцикл, В-легковий
// автомобіль, С-вантажний автомобіль). Вивести на екран назву
// транспортного засобу, яким він може керувати.
const category = prompt(
    "Введіть назву категорії водія (A, B, C):"
).toUpperCase();
switch (category) {
    case "A":
        document.write("Ви можете керувати мотоциклом.");
        break;
    case "B":
        document.write("Ви можете керувати легковим автомобілем.");
        break;
    case "C":
        document.write("Ви можете керувати вантажним автомобілем.");
        break;
    default:
        document.write("Невідома категорія. Будь ласка, введіть A, B або C.");
}
